In [4]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
data = [4.5, 7.2, -5.3, 3.6]
index = ['d', 'b', 'a', 'c']
obj = pd.Series(data, index=index)
obj
obj2 = obj.reindex(sorted(index))
obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [4]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3
obj3.reindex(range(6), method='ffill')

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [5]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
frame
type(frame)
frame = frame.reindex(['a', 'b', 'c', 'd'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

pandas.core.frame.DataFrame

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [6]:
frame2 = frame.reindex(sorted(index))
frame2
type(frame2)
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

pandas.core.frame.DataFrame

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [7]:
states = ['Texas', 'Utah', 'California']
frame2.reindex(columns=states)
type(frame2)
frame2

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

pandas.core.frame.DataFrame

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [8]:
frame.loc[['a', 'b', 'c', 'd'], 'Ohio']
# frame2.reindex(labels=['a', 'b', 'c', 'd'])
frame.loc['b']

a    0.0
b    NaN
c    3.0
d    6.0
Name: Ohio, dtype: float64

Ohio         NaN
Texas        NaN
California   NaN
Name: b, dtype: float64

In [9]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj
new_obj = obj.drop('c')
new_obj
obj.drop(['d', 'c'])

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [10]:
data = pd.DataFrame(np.arange(16.).reshape((4, 4)),
                   index=['ohio','colorado','utah','new york'],
                   columns=['one','two','three','four'])
data
data.drop('two',axis=1)
data.drop(['two','four'], axis='columns')

           one   two  three  four
ohio       0.0   1.0    2.0   3.0
colorado   4.0   5.0    6.0   7.0
utah       8.0   9.0   10.0  11.0
new york  12.0  13.0   14.0  15.0

           one  three  four
ohio       0.0    2.0   3.0
colorado   4.0    6.0   7.0
utah       8.0   10.0  11.0
new york  12.0   14.0  15.0

           one  three
ohio       0.0    2.0
colorado   4.0    6.0
utah       8.0   10.0
new york  12.0   14.0

In [19]:
obj.drop(index='a')
obj.drop(labels='b')

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [20]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj
obj['b']
obj[1]
obj[2:4]
obj[['b', 'a', 'd']]
obj[[1, 3]]
obj[obj<2]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

1.0

1.0

c    2.0
d    3.0
dtype: float64

b    1.0
a    0.0
d    3.0
dtype: float64

b    1.0
d    3.0
dtype: float64

a    0.0
b    1.0
dtype: float64

In [9]:
obj.drop('a', axis=0)

b    1.0
c    2.0
d    3.0
dtype: float64

In [15]:
a = range(4)
list(a)
b = np.arange(4.)
b

[0, 1, 2, 3]

array([0., 1., 2., 3.])

In [23]:
obj['b':'d'] = 5.
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [31]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['ohio','colorado','utah','new york'],
                    columns=['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [32]:
data['two']
data[['three','one']]
data[:2]

ohio         1
colorado     5
utah         9
new york    13
Name: two, dtype: int32

          three  one
ohio          2    0
colorado      6    4
utah         10    8
new york     14   12

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [46]:
type(data['three'])
type(data[['three']])
data[['three']]
data[data['three']<5]
data[data['three']>5]
data[data>5]

pandas.core.series.Series

pandas.core.frame.DataFrame

          three
ohio          2
colorado      6
utah         10
new york     14

      one  two  three  four
ohio    0    1      2     3

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

           one   two  three  four
ohio       NaN   NaN    NaN   NaN
colorado   NaN   NaN    6.0   7.0
utah       8.0   9.0   10.0  11.0
new york  12.0  13.0   14.0  15.0

In [47]:
data.loc['colorado', ['two','three']]
data.iloc[2, [3, 0, 1]]

two      5
three    6
Name: colorado, dtype: int32

four    11
one      8
two      9
Name: utah, dtype: int32

In [49]:
data
data.iloc[2]
data.iloc[[1, 2], [3, 0, 1]]
data.loc[:'utah','two']

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

one       8
two       9
three    10
four     11
Name: utah, dtype: int32

          four  one  two
colorado     7    4    5
utah        11    8    9

ohio        1
colorado    5
utah        9
Name: two, dtype: int32

In [67]:
type(data)
# data.iloc[:, :3][data.three >5]
data['three']['utah'] = '你好'
data

data.three.astype(str)
type(data.three['ohio'])

pandas.core.frame.DataFrame

          one  two three  four
ohio        0    1     2     3
colorado    4    5     6     7
utah        8    9    你好    11
new york   12   13    14    15

ohio         2
colorado     6
utah        你好
new york    14
Name: three, dtype: object

int